! common commands with switch won't be shown here.

R1# show arp
R1# show interfaces [number]
R1# show interfaces [number] controller
R1# show ip arp
R1# show ip interfaces brief
R1# show ip route
R1# show ip route {static|connected|ospf} 
R1# show ip route 172.16.2.0
R1# show protocols [number]
R1# show vlans

---------------------------------------------------------

R1(config)# interface GigabitEthernet 0/0/0
R1(config-if)# no shutdown 

R1(config-if)# interface GigabitEthernet 0/0/0.20
R1(config-subif)# encapsulation dot1q 20
R1(config-subif)# ip address 192.168.10.1 255.255.255.0

! for native vlan
! although there is no need to use native vlan

R1(config-if)# interface GigabitEthernet 0/0/0.10
R1(config-if)# encapsulation dot1q 10 native
R1(config-subif)# ip address 192.168.10.1 255.255.255.0

! or

R1(config)# no interface GigabitEthernet 0/0/0.10
R1(config)# interface GigabitEthernet 0/0/0
R1(config-subif)# ip address 192.168.10.1 255.255.255.0

! note that for vlan 20, ip is already set on g0/0/0.20

---------------------------------------------------------

R1(config)# ip route 0.0.0.0 0.0.0.0 213.10.0.45
R1(config)# ip route 192.168.10.0 255.255.255.0 192.168.20.2 [administrative number] [permanent] 
R1(config)# ip route 192.168.10.0 255.255.255.0 g0/0
R1(config)# ip route 192.168.10.0 255.255.255.0 g0/0 192.168.20.2

---------------------------------------------------------
! other

R1(config)# clear ip arp [number]
R1(config)# default interface g0/0

R1(config-if)# [no] negotiation auto





